---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.LinePatternId
source: html/99830c67-ba7a-e28b-0d65-18b57c7f93af.htm
---
# Autodesk.Revit.DB.MEPSystemType.LinePatternId Property

Indicates the line pattern id that should override the line pattern id for all components in the system.

## Syntax (C#)
```csharp
public ElementId LinePatternId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null